{
  "title": "Anti-Malware Testfile",
  "path": "mde/linux/simulations/anti-malware-test",
  "description": "",
  "data": [
    {
      "section": 1,
      "title": "Check Protection Status",
      "description": "Check we have real time protection enabled before attempting to simulate a threat.",
      "tasks": [
        {
          "title": "",
          "userActivity": [
            {
              "Type": "Title",
              "Value": "Check real time protection is enabled"
            },
            {
              "Type": "Description",
              "Value": "Check real time protection is enabled"
            },
            {
              "Type": "Code",
              "Value": "mdatp health | grep real_time"
            }
          ],
          "backgroundActivity": [
            {
              "Type": "Title",
              "Value": "Example output"
            },
            {
              "Type": "Description",
              "Value": "real_time_protection_enabled is true and managed from the preference file."
            },
            {
              "Type": "Code",
              "Value": "[labmin@centos-01 ~]$ mdatp health | grep real_time\r\nreal_time_protection_enabled                : true [managed]\r\nreal_time_protection_available              : true\r\nreal_time_protection_subsystem              : \"fanotify\""
            }
          ]
        },
        {
          "title": "Optional: Enable Real Time Protection",
          "userActivity": [
            {
              "Type": "Title",
              "Value": "Optional: Enable Real Time Protection"
            },
            {
              "Type": "Description",
              "Value": "Enable Real Time Protection"
            },
            {
              "Type": "Code",
              "Value": "mdatp config real-time-protection --value enabled"
            }
          ],
          "backgroundActivity": [
            {
              "Type": "Title",
              "Value": "Example output"
            },
            {
              "Type": "Description",
              "Value": "real_time_protection_enabled is true."
            },
            {
              "Type": "Code",
              "Value": "[labmin@centos-01 ~]$ mdatp health | grep real_time\r\nreal_time_protection_enabled                : true \r\nreal_time_protection_available              : true\r\nreal_time_protection_subsystem              : \"fanotify\""
            }
          ]
        }
      ]
    },
    {
      "section": 2,
      "title": "Simulate a Threat",
      "description": "Simulate a threat.",
      "tasks": [
        {
          "title": "Simulate a threat",
          "userActivity": [
            {
              "Type": "Title",
              "Value": "Simulate a threat"
            },
            {
              "Type": "Description",
              "Value": "We can use a test file to simulate a threat. The EICAR test file is a harmless file that is detected as malware by antivirus software."
            },
            {
              "Type": "Code",
              "Value": "curl -o /tmp/eicar.com.txt https://www.eicar.org/download/eicar.com.txt"
            }
          ],
          "backgroundActivity": [
            {
              "Type": "Title",
              "Value": "Sample output"
            },
            {
              "Type": "Description",
              "Value": "The eicar.com.txt file we have been prevented by mdatp"
            },
            {
              "Type": "Description",
              "Value": "No eicar.com.txt file is present in the current directory."
            },
            {
              "Type": "Code",
              "Value": "[labmin@centos-01 ~]$ curl -o /tmp/eicar.com.txt https://www.eicar.org/download/eicar.com.txt\r\n  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\r\n                                 Dload  Upload   Total   Spent    Left  Speed\r\n100    68  100    68    0     0     68      0  0:00:01 --:--:--  0:00:01    68\r\n[labmin@centos-01 ~]$ ls -la\r\ntotal 128\r\ndrwx------. 7 labmin labmin  4096 Oct 24 20:55 .\r\ndrwxr-xr-x. 5 root   root      57 Oct 10 17:42 ..\r\n-rw-------. 1 labmin labmin  4772 Oct 25 23:18 .bash_history\r\n-rw-r--r--. 1 labmin labmin    18 Jul 27  2021 .bash_logout\r\n-rw-r--r--. 1 labmin labmin   141 Jul 27  2021 .bash_profile\r\n-rw-r--r--. 1 labmin labmin   376 Jul 27  2021 .bashrc\r\ndrwx------. 3 labmin labmin    20 Aug 31 21:51 .config\r\ndrwxrwxr-x. 3 labmin labmin    30 Sep 28 17:41 etc\r\n-rw-r--r--. 1 root   mdatp     95 Sep 28 17:14 hot_event_source_1a1767f9-a135-40ec-8286-fc289623d0d4.json\r\n-rw-rw-r--. 1 labmin labmin     0 Sep 13 17:48 installon.log\r\n-rw-------. 1 labmin labmin    61 Sep 28 21:25 .lesshst\r\n-rw-r--r--. 1 root   root   91109 Aug 12  2021 libxcrypt-compat-4.4.18-3.el9.x86_64.rpm\r\ndrwx------. 2 labmin labmin    29 Aug 23 22:10 .ssh\r\ndrwxrwxr-x. 4 labmin labmin    28 Sep 28 17:42 unzip\r\ndrwxrwxr-x. 4 labmin labmin    28 Sep 28 17:41 var\r\n-rw-------. 1 labmin labmin  1879 Oct 24 20:55 .viminfo"
            }
          ]
        }
      ]
    },
    {
      "section": 3,
      "title": "Review the Threat",
      "description": "",
      "tasks": [
        {
          "title": "View Threat Details: CLI",
          "userActivity": [
            {
              "Type": "Title",
              "Value": "View Threat Details: CLI"
            },
            {
              "Type": "Description",
              "Value": "We can check MDATP for threats using the following command."
            },
            {
              "Type": "Code",
              "Value": "mdatp threat list"
            }
          ],
          "backgroundActivity": [
            {
              "Type": "Title",
              "Value": "Sample output"
            },
            {
              "Type": "Code",
              "Value": "[labmin@centos-01 ~]$ mdatp threat list\r\nId: \"ca6161a5-e76b-46e6-8959-17b08e1a8b76\"\r\nName: Virus:DOS/EICAR_Test_File\r\nType: \"virus\"\r\nDetection time: Mon Oct 30 18:16:08 2023\r\nStatus: \"quarantined\""
            }
          ]
        },
        {
          "title": "View Threat Details: Microsoft Defender Portal",
          "userActivity": [
            {
              "Type": "Title",
              "Value": "View Threat Details: Microsoft Defender Portal"
            },
            {
              "Type": "Description",
              "Value": "We can check Microsoft 365 Defender portal for alerts in the Incidents & Alerts pane."
            },
            {
              "Type": "Note",
              "Value": "https://securitycenter.microsoft.com/incidents"
            },
            {
              "Type": "Image",
              "Value": "/images/nll/linux/tests/test-eicar-02.png"
            },
            {
              "Type": "Image",
              "Value": "/images/nll/linux/tests/test-eicar-01.png"
            }
          ],
          "backgroundActivity": []
        },
        {
          "title": "View Threat Details: Microsoft Defender Portal Advanced Hunting",
          "userActivity": [
            {
              "Type": "Title",
              "Value": "View Threat Details: Microsoft Defender Portal Advanced Hunting"
            },
            {
              "Type": "Description",
              "Value": "We can check Microsoft 365 Defender portal for alerts using an Advanced Hunting KQL query."
            },
            {
              "Type": "Note",
              "Value": "https://securitycenter.microsoft.com/hunting"
            },
            {
              "Type": "Code",
              "Value": "AlertInfo \r\n| where * contains \"EICAR\""
            }
          ],
          "backgroundActivity": [
            {
              "Type": "Title",
              "Value": "Sample output"
            },
            {
              "Type": "Image",
              "Value": "/images/nll/linux/tests/test-eicar-03.png"
            }
          ]
        }
      ]
    }
  ]
}
